Repository: SbercoinCom/sbercoin-flutter
Catalog: lib/src/l10n/app_*.arb
Languages: ru

source: Add wallet
ru: Добавьте кошелек

source: Create new wallet
ru: Создать новый кошелек

source: Import wallet
ru: Импортировать кошелек

source: Save seed phrase
ru: Сохраните seed-фразу

source: Seed phrase copied!
ru: Seed-фраза скопирована

source: Undo
ru: Скрыть

source: Copy
ru: Скопировать

source: Next
ru: Далее

source: Confirm seed phrase
ru: Подтвердите seed-фразу

source: Confirm
ru: Подтвердить

source: Seed phrase
ru: Seed-фраза

source: Paste here
ru: Введите здесь

source: Warning!
ru: Предупреждение!

# doesNotApplyToBIP39
source: Your seed phrase does not apply to BIP39 standard. Probably, you created your seed phrase with other application. If you are sure in that seed phrase, please restore your wallet with WIF.
ru: Введенная seed-фраза не удовлетворяет стандарту BIP39. Возможно, вы создавали ее через другое приложение. Если вы уверены в корректности вашей seed-фразы, пожалуйста, восстановите ваш кошелек через WIF.

source: Sbercoin.com wallet
ru: Кошелек Sbercoin.com

# txList
source: Transaction list
ru: Список транзакций

source: Available balance
ru: Доступный баланс

source: Immature balance
ru: Незрелый баланс

source: Address copied
ru: Адрес скопирован

source: Do you want to enable fingerprint?
ru: Вы хотите использовать отпечаток пальца?

source: Enable fingerprint
ru: Использовать отпечаток

source: Skip
ru: Пропустить

source: To
ru: Получатель

source: Value
ru: Сумма

source: Fee (Greph)
ru: Комиссия (Greph)

source: Gas limit
ru: Лимит газа

# gasPrice_greph_per_gas
source: Gas price (Greph/gas)
ru: Цена газа (Greph/gas)

# txSent
source: Transaction sent!
ru: Транзакция отправлена!

# txError
source: Transaction error!
ru: Ошибка транзакции

source: Change PIN
ru: Сменить PIN-код

source: Smart contracts
ru: Смарт-контракты

source: About
ru: О проекте

source: Logout
ru: Выйти

# sentTx
source: Sent transaction
ru: Отправлено

source: Received
ru: Получено

source: Sent to contract
ru: Отправлено в контракт

# gasRefunded
source: Gas refuned
ru: Возврат газа

source: Mined
ru: Добыто

# txDetailes
source: Transaction detailes
ru: Детали транзакции

# txID
source: transaction ID
ru: ID тразнакции

source: Block hash
ru: Хэш блока

source: Block height
ru: Высота блока

source: Timestamp
ru: Время

source: Amount
ru: Сумма

source: Copied
ru: Скопировано

source: Your
ru: Ваши

source: Contract address
ru: Адрес контракта

source: Name
ru: Название

source: Symbol
ru: Тикер

source: Decimals
ru: Десятки

# createPasscode
source: Please create passcode
ru: Придумайте PIN-код

# enterPasscode
source: Please enter passcode
ru: Введите PIN-код

# confirmPasscode
source: Please confirm passcode
ru: Подтвердите PIN-код

source: Cancel
ru: Отмена

# authRequired
source: Authentication required
ru: Требуется аутентификация

# pleaseAuth
source: Please authenticate
ru: Пожалуйста, аутентифицируйтесь

# aboutProject
source: Sbercoin.com is a decentralized blockchain project built on Bitcoin's UTXO model, with support for Ethereum Virtual Machine based smart contracts, and secured by a proof of stake consensus model.
ru: Sbercoin.com - децентрализованная блокчейн-платформа, использующая Bitcoin UTXO модель, поддерживающая смарт-контракты виртуальной машины Ethereum, а также имеющая алгоритм консенсуса Proof-of-Stake

source: Call smart contract
ru: Вызов смарт-контракта

source: Smart contract address
ru: Адрес смарт-контракта

source: Paste ABI
ru: Вставьте ABI

source: Value (SBER)
ru: Сумма (SBER)

# youDontHaveTokens
source: You don't have any tokens
ru: У вас нет никаких токенов

# youHadNotSentTxs
source: You had not sent any transactions
ru: Вы не совершали транзакций

# youDontHaveEnoughCoins
source: You don't have enough coins to send
ru: У вас недостаточно коинов для совершения транзакции

source: Show WIF
ru: Показать WIF

# showMnemonic
source: Show seed phrase
ru: Показать seed-фразу

source: Your WIF
ru: Ваш WIF

# yourMnemonic
source: Your seed phrase
ru: Ваша seed-фраза

source: Error
ru: Ошибка

# cannotShowMnemonic
source: Cannot show seed phrase because you had not uploaded it
ru: Невозможно отобразить seed-фразу, потому что она не была загружена
